/**
 * 题目：
 * 	创建一个java文件，起名123.java可以吗？
 * 		可以，完全可以，在windows操作系统中文件名叫做123.java没毛病。
 * 	123其实并不是标识符。只是一个文件名。
 * 
 * 标识符除了命名规则之外，还有命名规范：
 * 	1、具体的命名规范是那些？
 * 		规范1：见名知意（这个标识符在起名的时候，最好一看这个单词就知道啥意思。）
 * 		
 * 		规范2：遵循驼峰命名方式，什么是驼峰（一高一低）
 * 			驼峰有利于单词与单词之间很好地进行分隔
 * 			BiaoShiFuTest，这个很好，一眼就能看出来是四个单词。
 * 
 * 			规范3：类名、接口名有特殊要求
 * 				变量名和方法名首字母大写，后面每个单词首字母大写。
 * 
 * 			规范4：变量名、方法名有特殊要求
 * 				变量名和方法名首字母小写，后面每个单词首字母大写。
 * 
 * 			规范5：所有常量名：全部大写，并且单词和单词之间采用下划线衔接。
 * 				USER_AGE：用户年龄
 */
public class IdentifieraTest {
	public static void main(String[] args) {
		int nianLing = 20;
		String mingZi = "zhangsan";
	}
}